Tekla.Structures.Drawing.Grid
The Grid class contains methods related to grids.
A drawing grid is inserted/removed using the view.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Drawing MyDrawing = new GADrawing();
View curview = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
new AABB(new Point(), new Point(30000, 30000, 10000)));
Grid curGrid;
DrawingObjectEnumerator allObjects = curview.GetAllObjects();
while(allObjects.MoveNext())
{
if(allObjects.Current is Grid)
{
curGrid = allObjects.Current as Grid;
curGrid.Attributes.DrawTextAtTopOfGrid = true;
curGrid.Attributes.Font.Color = DrawingColors.Red;
curGrid.Modify(); /* Apply changes */
}
}
}
}

Tekla.Structures.Drawing.Grid.Attributes
The attributes of the grid.
For more information see Tekla.Structures.Drawing.Grid.GridAttributes.

Tekla.Structures.Drawing.Grid.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Grid.GetObjects
Retrieves a DrawingObjectEnumerator for all the grid lines of the grid.
Returns: A DrawingObjectEnumerator for all the grid lines of the grid.

Tekla.Structures.Drawing.Grid.GetObjects(System.Type[])
Retrieves a DrawingObjectEnumerator for all the grid lines of the grid that are of certain TypeFilter.
TypeFilter: The types of the grid lines to get.
Returns: A DrawingObjectEnumerator for all the grid lines of the grid that are of certain TypeFilter.

Tekla.Structures.Drawing.Grid.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Grid.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Grid.Select
Calls the system to select and retrieve the object.
Returns: True on success.

Tekla.Structures.Drawing.Grid.Delete
Grids cannot be deleted.
Returns: False.